from django.db.models import Sum

from .models import Statistic


def top_goal(team):
    top = Statistic.objects.filter(
        team__title=team).values(
            'name__id',
            'name__name').annotate(
                goal=Sum('goal')).order_by('-goal').first()
    return top


def top_point(team):
    top = Statistic.objects.filter(
        team__title=team).values(
            'name__id', 'name__name').annotate(
                point=Sum('point')).order_by('-point').first()
    return top


def top_season_goal(team):
    top_s_goal = Statistic.objects.filter(
        team__title=team).values(
            'name__id',
            'name__name',
            'goal',
            'season__name').order_by('-goal').first()
    return top_s_goal


def top_season_point(team):
    top_s_point = Statistic.objects.filter(
        team__title=team).values(
            'name__id',
            'name__name',
            'point',
            'season__name').order_by('-point').first()
    return top_s_point


def prev_next_season(season):
    next_season = season[:2] + str(int((season)[2:4]) + 1) + \
        season[4:5] + str(int(season[5:]) + 1)
    previous_season = season[:2] + str(int((season)[2:4]) - 1) + \
        season[4:5] + str(int(season[5:]) - 1)
    return (next_season, previous_season)


all_team_major_l = {
    'Динамо': 'Москва',
    'ЦСКА': 'Москва',
    'Крылья Советов': 'Москва',
    'Спартак': 'Москва',
    'СКА': 'Ленинград',
    'Трактор': 'Челябинск',
    'Торпедо': 'Горький',
    'Химик': 'Воскресенск',
    'Динамо (Р)': 'Рига',
    'Автомобилист': 'Свердловск',
    'Сокол': 'Киев',
    'Локомотив': 'Москва',
    'Сибирь': 'Новосибирск',
    'Кристалл (Эл)': 'Электросталь',
    'Кировец': 'Ленинград',
    'Динамо (Л)': 'Ленинград',
    'ВВС': 'Москва',
    'Динамо (Тл)': 'Таллин',
    'Ижсталь': 'Ижевск',
    'Металлург (Нвк)': 'Новокузнецк',
    'СКА (К)': 'Калинин',
    'Динамо (Св)': 'Свердловск',
    'Молот': 'Пермь',
    'Салават Юлаев': 'Уфа',
    'Авангард (Омск)': 'Омск',
    'Динамо (Мин)': 'Минск',
    'Торпедо (Я)': 'Ярославль',
    'Ак Барс': 'Казань',
    'Кристалл': 'Саратов',
    'ЛИИЖТ': 'Ленинград',
    'Спартак (Мин)': 'Минск',
    'Торпедо (У-К)': 'Усть-Каменогорск',
    'Буревестник (М)': 'Москва',
    'Динамо (Х)': 'Харьков',
    'СКА (Кб)': 'Куйбышев',
    'Большевик': 'Ленинград',
    'Буревестник (Ч)': 'Челябинск',
    'Водник': 'Архангельск',
    'ДО (Св)': 'Свердловск',
    'Кауно Аудиняй': 'Каунас',
    'Команда г. Каунас': 'Каунас',
    'СКА (Нвс)': 'Новосибирск',
    'СК им. Сталина': 'Пермь',
    'Спартак (Кау)': 'Каунас',
    'Спартак (Л)': 'Ленинград',
    'Спартак (У)': 'Ужгород',
    'Торпедо (Мин)': 'Минск',
    'Урожай': 'Челябинск'
}


all_team_league_one = {
    'Авангард (Омск)': 'Омск',
    'Авангард (Уфа)': 'Уфа',
    'Автомобилист': 'Свердловск',
    'Автомобилист (Крг)': 'Караганда',
    'Ак Барс': 'Казань',
    'Бинокор': 'Ташкент',
    'Буран': 'Воронеж',
    'Дизелист': 'Пенза',
    'Динамо (Мин)': 'Минск',
    'Динамо (Х)': 'Харьков',
    'Енбек': 'Алма-Ата',
    'Звезда': 'Оленегорск',
    'Ижорец': 'Ленинград',
    'Ижсталь': 'Ижевск',
    'Кренгольм': 'Нарва',
    'Кристалл': 'Саратов',
    'Кристалл (Эл)': 'Электросталь',
    'Лада': 'Тольятти',
    'Латвияс Берзс': 'Рига',
    'Локомотив': 'Москва',
    'Луч': 'Свердловск',
    'Металлург (Мг)': 'Магнитогорск',
    'Металлург (Нвк)': 'Новокузнецк',
    'Металлург (Чрп)': 'Череповец',
    'Мечел': 'Челябинск',
    'Молот': 'Пермь',
    'Прогресс-ШВСМ': 'Гродно',
    'Рубин': 'Тюмень',
    'СКА (К)': 'Калинин',
    'СКА (Кб)': 'Куйбышев',
    'СКА (Нвс)': 'Новосибирск',
    'СКА (Св)': 'Свердловск',
    'СКА (Хбр)': 'Хабаровск',
    'Салават Юлаев': 'Уфа',
    'Сибирь': 'Новосибирск',
    'Сокол': 'Киев',
    'Спутник': 'Нижний Тагил',
    'Таллэкс': 'Таллин',
    'Торпедо (У-К)': 'Усть-Каменогорск',
    'Торпедо (Я)': 'Ярославль',
    'ШВСМ': 'Киев',
    'Шахтер': 'Прокопьевск'
}
